Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: New track
it_it: Nuova track

source: New widget
it_it: Nuovo widget

source: Newline characters are handled automatically by the Label Widget.
it_it: I caratteri di "newline" [nuova riga] vengono gestiti automaticamente dal Widget Label.

source: Next, call :cpp:expr:`lv_monkey_create(cfg)` to create the Monkey.
it_it: Successivamente, si chiama :cpp:expr:`lv_monkey_create(cfg)` per creare il Monkey.

source: Next, declare a variable (it can be local) of type :cpp:type:`lv_monkey_config_t` to define the configuration structure, initialize it using :cpp:expr:`lv_monkey_config_init(cfg)` then set its ``type`` member to the desired type of :ref:`input device <indev>`, and set the ``min`` and ``max`` values for its ``period_range`` and ``input_range`` members to set the time ranges (in milliseconds) and input ranges the Monkey module will use to generate random input at random times.
it_it: Successivamente, dichiara una variabile (può essere locale) di tipo :cpp:type:`lv_monkey_config_t` per definire la struttura di configurazione, inizializzala usando :cpp:expr:`lv_monkey_config_init(cfg)`, quindi imposta il suo membro ``type`` sul tipo desiderato di :ref:`input device <indev>` e imposta i valori ``min`` e ``max`` per i suoi membri ``period_range`` e ``input_range`` per impostare gli intervalli di tempo (in millisecondi) e gli intervalli di input che il modulo Monkey utilizzerà per generare input casuali in momenti casuali.

source: Next, set the range using :cpp:expr:`lv_scale_section_set_range(section, min, max)` where ``min`` and ``max`` are the Section's boundary values that should normally be within the Scale's value range.
it_it: Successivamente, si imposta l'intervallo usando :cpp:expr:`lv_scale_section_set_range(section, min, max)` dove ``min`` e ``max`` sono i valori limite della Sezione che normalmente dovrebbero essere compresi nell'intervallo di valori della "Scale".

source: No *Keys* are processed by Animation-Image Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Animation-Image.

source: No *Keys* are processed by Bar Widgets.
it_it: I Widget Bar non elaborano *tasti*.

source: No *Keys* are processed by Canvas Widgets.
it_it: I Widget Canvas non elaborano alcun *Tasto*.

source: No *Keys* are processed by Chart Widgets.
it_it: Nessun *tasto* viene elaborato dai Widget Chart.

source: No *Keys* are processed by Image Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Image.

source: No *Keys* are processed by LED Widgets.
it_it: I Widget LED non elaborano alcun *tasto*.

source: No *Keys* are processed by Label Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Label.

source: No *Keys* are processed by Line Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Line.

source: No *Keys* are processed by List Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget List.

source: No *Keys* are processed by Menu Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Menu.

source: No *Keys* are processed by Message Box Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget "Message Box".

source: No *Keys* are processed by Scale Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget "Scale".

source: No *Keys* are processed by Span Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Span.

source: No *Keys* are processed by Spinner Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Spinner.

source: No *Keys* are processed by Tileview Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Tileview.

source: No *Keys* are processed by Window Widgets.
it_it: Nessun *Tasto* viene elaborato dai Widget Window.

source: No ``NULL`` termination and no count parameter.
it_it: Nessuna terminazione ``NULL`` e nessun parametro di conteggio.

source: No additional initialization is required beyond the normal DRM setup.
it_it: Non è richiesta alcuna inizializzazione aggiuntiva oltre alla normale configurazione DRM.

source: No buffers are required for the LVGL EVE renderer because no pixels are written to any buffers in the device running LVGL.
it_it: Non sono necessari buffer per il renderer LVGL EVE perché nessun pixel viene scritto nei buffer del dispositivo che esegue LVGL.

source: No changes required, just upgrade LVGL and your GIFs will render faster.
it_it: Non sono necessarie modifiche, basta aggiornare LVGL e le GIF saranno renderizzate più velocemente.

source: No events are emitted by Lottie Widgets.
it_it: Nessun evento viene emesso dai Widget di Lottie.

source: No examples yet.
it_it: Nessun esempio ancora.

source: No extra code is required.
it_it: Non è richiesto alcun codice aggiuntivo.

source: No keys are processed by Lottie Widgets.
it_it: Nessun tasto viene elaborato dai Widget Lottie.

source: No loading is needed as :cpp:expr:`lv_font_t` can be used directly.
it_it: Non è necessario alcun caricamento poiché :cpp:expr:`lv_font_t` può essere utilizzato direttamente.

source: No need for the compile-flash-boot cycle.
it_it: Non è necessario il ciclo di compilazione-flash-boot.

source: No need to know C to create a nice GUI on an embedded system.
it_it: Non è necessario conoscere il C per creare una buona GUI su un sistema embedded.

source: No real Widgets are created for cells --- they are just drawn on the fly.
it_it: Non vengono creati veri e propri widget per le celle: vengono semplicemente disegnati al volo.

source: No special events are sent by Animation-Image Widgets.
it_it: Nessun evento speciale viene inviato dai Widget Animation-Image.

source: No special events are sent by Bar Widgets.
it_it: I Widget Bar non inviano eventi speciali.

source: No special events are sent by Canvas Widgets.
it_it: I Widget Canvas non inviano eventi speciali.

source: No special events are sent by Image Widgets.
it_it: I Widget Image non inviano eventi speciali.

source: No special events are sent by LED Widgets.
it_it: I Widget LED non inviano eventi speciali.

source: No special events are sent by Label Widgets.
it_it: I Widget Label non inviano eventi speciali.

source: No special events are sent by List Widgets, but events can be sent by Buttons as usual.
it_it: I Widget List non inviano eventi speciali, ma gli eventi possono essere inviati dai Pulsanti come di consueto.

source: No special events are sent by Message Box Widgets.
it_it: I Widget "Message Box" non inviano eventi speciali.

source: No special events are sent by Scale Widgets.
it_it: I Widget "Scale" non inviano eventi speciali.

source: No special events are sent by Span Widgets.
it_it: I Widget Span non inviano eventi speciali.

source: No special events are sent by Spinner Widgets.
it_it: I Widget Spinner non inviano eventi speciali.

source: No special events are sent by Window Widgets, however events can be added to any Buttons added.
it_it: I Widget Window non inviano eventi speciali, tuttavia è possibile aggiungere eventi a qualsiasi Pulsante aggiunto.

source: No special hardware requirements
it_it: Nessun requisito hardware speciale

source: No special setup is required beyond the basic DRM initialization shown in :ref:`linux_drm_basic_usage`.
it_it: Non è richiesta alcuna configurazione speciale oltre all'inizializzazione DRM di base mostrata in :ref:`linux_drm_basic_usage`.

source: No specific action is required.
it_it: Non è richiesta alcuna azione specifica.

source: No stride alignment is required: set :c:macro:`LV_DRAW_BUF_STRIDE_ALIGN` to `1` in "lv_conf.h".
it_it: Non è richiesto alcun allineamento di "stride": impostare :c:macro:`LV_DRAW_BUF_STRIDE_ALIGN` a `1` in "lv_conf.h".

source: Non-editable widgets are scrolled, and for editable widgets, the event is sent.
it_it: I widget non modificabili vengono fatti scorrere e, per quelli modificabili, l'evento viene inviato.

source: Non-generated C and H files that are just wrappers around the generated ones where custom code can be placed.
it_it: File C e H non generati che sono solo wrapper di quelli generati in cui è possibile inserire codice personalizzato.

source: Non-permanent screens will be deleted and created automatically when they are opened and closed.
it_it: Le schermate non permanenti verranno eliminate e create automaticamente all'apertura e alla chiusura.

source: Non-scrollable Widgets can still propagate the scrolling (chain) to their parents.
it_it: I Widget non-scrollable possono comunque propagare lo scorrimento (chain [catena]) ai widget padre.

source: Normal Fonts
it_it: Font Normali

source: Normal maps for surface detail
it_it: Mappe delle normali per i dettagli delle superfici

source: Normal usage:
it_it: Utilizzo normale:

source: Normally a Widget can't be scrolled past the extremities of its content.
it_it: Normalmente non è possibile scorrere un Widget oltre le estremità del suo contenuto.

source: Normally the dirty (a.k.a invalid) areas are checked and redrawn in every :c:macro:`LV_DEF_REFR_PERIOD` milliseconds (set in ``lv_conf.h``).
it_it: Normalmente le aree sporche (ovvero non valide) vengono controllate e ridisegnate ogni :c:macro:`LV_DEF_REFR_PERIOD` millisecondi (impostati in ``lv_conf.h``).

source: Normally the invalidated areas (marked for redrawing) are rendered in :cpp:func:`lv_timer_handler` in every :c:macro:`LV_DEF_REFR_PERIOD` milliseconds.
it_it: Normalmente le aree invalidate (contrassegnate per il ridisegno) vengono renderizzate in :cpp:func:`lv_timer_handler` ogni :c:macro:`LV_DEF_REFR_PERIOD` millisecondi.

source: Normally this is not important for the user, but if you remove a widget’s styles, its coordinates may be removed too:
it_it: Normalmente questo non è importante per l'utente, ma se si rimuovono gli stili di un widget, potrebbero essere rimosse anche le sue coordinate:

source: Normally ticks and their labels are drawn first and the main line is drawn next, giving the ticks and their labels the appearance of being underneath the main line when there is overlap.
it_it: Normalmente, le tacche e le relative etichette vengono disegnate per prime, seguite dalla linea principale, dando l'impressione che le tacche e le relative etichette siano posizionate sotto la linea principale quando si sovrappongono.

source: Normally underlining and combining these text styles is not possible in reStructuredText.
it_it: Normalmente, la sottolineatura e la combinazione di questi stili di testo non sono possibili in reStructuredText.

source: Normally you won't need these since Text Area automates the text selection process, but if you do need to change the selection programmatically, the above are your tools to do so.
it_it: Normalmente non ce n'è bisogno, poiché la Text Area automatizza il processo di selezione del testo, ma per modificare la selezione a livello di codice, gli strumenti sopra indicati sono quelli da usare.

source: Normally, an environment where :ref:`lv_keyboard` can run can also run ``lv_ime_pinyin``.
it_it: Normalmente, un ambiente in cui può essere eseguito :ref:`lv_keyboard`, può eseguire anche ``lv_ime_pinyin``.

source: Normally, an input device is read every :c:macro:`LV_DEF_REFR_PERIOD` milliseconds (set in ``lv_conf.h``).
it_it: Normalmente, un dispositivo di input viene letto ogni :c:macro:`LV_DEF_REFR_PERIOD` millisecondi (impostato in ``lv_conf.h``).

source: Normally, that evaluation:
it_it: Normalmente, tale valutazione:

source: Normally, the Slider can be adjusted either by dragging the knob, or by clicking on the Slider bar.
it_it: Normalmente, lo Slider può essere regolato trascinando la manopola o cliccando sulla barra dello Slider.

source: Normally, the user shouldn't use this parameter but if a custom widget is created it might be useful.
it_it: Normalmente, l'utente non dovrebbe utilizzare questo parametro, ma se si creasse un widget personalizzato potrebbe essere utile.

source: Normally, you set the Animation duration directly using :cpp:expr:`lv_anim_set_duration(&anim_template, duration_in_ms)`.
it_it: Normalmente, si imposta la durata dell'animazione direttamente tramite :cpp:expr:`lv_anim_set_duration(&anim_template, duration_in_ms)`.

source: Not all the original aggressive HTML minifications are standard XML, so this is a subset that preserves standard XML syntax.
it_it: Non tutte le "minificazioni" HTML aggressive originali sono XML standard, quindi questo è un sottoinsieme che preserva la sintassi XML standard.

source: Not applies to ``track_cross_place``.
it_it: Non si applica a ``track_cross_place``.

source: Not called if scrolled.
it_it: Non richiamato se si scorre.

source: Not scrollable
it_it: Non "scrollable"

source: Not to be confused with a :ref:`Display's main 4 layers <display_screen_layers>`, a :dfn:`Draw Layer` is a buffer created during rendering, necessitated by certain style properties, so different sets of pixels are correctly combined.
it_it: Da non confondere con i :ref:`4 layer principali del display <display_screen_layers>`, un :dfn:`Draw Layer` è un buffer creato durante il rendering, necessario per determinate proprietà di stile, in modo che diversi set di pixel vengano combinati correttamente.

source: Notable forks:
it_it: Fork degne di nota:

source: Note also that the path can be a relative path or a "rooted path" (beginning with ``/``), though rooted paths are recommended since the driver does not yet provide a way to set the default directory.
it_it: Si noti inoltre che il path può essere un percorso relativo o un "rooted path" (che inizia con ``/``), i path rooted sono consigliati poiché il driver non fornisce ancora un modo per impostare la directory di default.

source: Note that "init" function creates only the :ref:`permanent screens <xml_screen_permanent>` but doesn't load any screens.
it_it: Si noti che la funzione "init" crea solo gli :ref:`screen permanenti <xml_screen_permanent>` ma non carica alcuno screen.

source: Note that :cpp:enumerator:`LV_CHART_UPDATE_MODE_SHIFT` also changes the ``start_point``.
it_it: Si noti che :cpp:enumerator:`LV_CHART_UPDATE_MODE_SHIFT` modifica anche ``start_point``.

source: Note that :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` manipulates the text buffer in-place in order to add/remove the dots.
it_it: Si noti che :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` manipola il buffer di testo sul posto per aggiungere/rimuovere i punti.

source: Note that :cpp:type:`lv_style_prop_t` (enumerator values beginning with ``LV_PROPERTY_STYLE_...``) are also valid property IDs, and can be used to set or get a Widget's style values.
it_it: Notare che :cpp:type:`lv_style_prop_t` (i valori dell'enumeratore che iniziano con ``LV_PROPERTY_STYLE_...``) sono anche ID di proprietà validi e possono essere utilizzati per impostare o ottenere i valori di stile di un Widget.

source: Note that :ref:`Widgets in XML <xml_widgets>` cannot be loaded at runtime, as widgets are built using C code.
it_it: Si noti che i :ref:`Widgets in XML <xml_widgets>` non possono essere caricati in fase di esecuzione, poiché i widget vengono creati utilizzando codice C.

source: Note that GCC has some known issues with Helium intrinsics.
it_it: Notare che GCC presenta alcuni problemi noti con le "Helium intrinsics".

source: Note that Widgets cannot be loaded from XML directly, but it's possible to write and register simple XML parsers for Widgets.
it_it: Si noti che i Widget non possono essere caricati direttamente da XML, ma è possibile scrivere e registrare semplici parser XML per i Widget.

source: Note that ``input_range`` has different meanings depending on the ``type`` input device:
it_it: Notare che ``input_range`` ha significati diversi a seconda del ``type`` del dispositivo di input:

source: Note that ``lv_dpx`` is evaluated only once, so if the DPI changes afterward, the value won’t be updated automatically.
it_it: Si noti che ``lv_dpx`` viene valutato una sola volta, quindi se il DPI cambia in seguito, il valore non verrà aggiornato automaticamente.

source: Note that ``start_time`` will override any value given to :cpp:expr:`lv_anim_set_delay(&anim_template, delay)`.
it_it: Si noti che ``start_time`` sovrascriverà qualsiasi valore specificato in :cpp:expr:`lv_anim_set_delay(&anim_template, delay)`.

source: Note that a ``NULL`` pointer is used to terminate the list.
it_it: Si noti che per terminare l'elenco viene utilizzato un puntatore ``NULL``.

source: Note that a cached image might continuously consume memory.
it_it: Si noti che un'immagine memorizzata nella cache potrebbe consumare memoria in modo continuo.

source: Note that before calling :cpp:expr:`lv_spangroup_delete_span`, :cpp:expr:`lv_observer_remove` needs to be called manually as LVGL can't remove the binding automatically.
it_it: Si noti che prima di chiamare :cpp:expr:`lv_spangroup_delete_span`, è necessario chiamare manualmente :cpp:expr:`lv_observer_remove` poiché LVGL non può rimuovere automaticamente il binding.

source: Note that dash works only on horizontal and vertical lines
it_it: Nota: il trattino funziona solo su linee orizzontali e verticali.

source: Note that gestures are not triggered if a widget is being scrolled.
it_it: Si noti che i gesti non vengono attivati ​​se esegue lo scrolling di un widget.

source: Note that gradients are not supported in LVGL's UI Editor yet.
it_it: Notare he i gradienti non sono ancora supportati nell'editor dell'interfaccia utente di LVGL.

source: Note that if :cpp:expr:`lv_async_call(my_function, data_p)` is called from a thread other than the one that normally makes LVGL calls, you are still obligated to protect the LVGL data structure using a MUTEX.
it_it: Si noti che, se :cpp:expr:`lv_async_call(my_function, data_p)` viene chiamato da un thread diverso da quello che normalmente effettua chiamate LVGL, si è comunque obbligati a proteggere la struttura dati LVGL utilizzando un MUTEX.

source: Note that if the current color format doesn't support colors (e.g. :cpp:enumerator:`LV_COLOR_FORMAT_A8`) the color will be ignored.
it_it: Si noti che, se il formato colore corrente non supporta i colori (ad esempio :cpp:enumerator:`LV_COLOR_FORMAT_A8`), il colore verrà ignorato.

source: Note that if the font resource description structure is not statically allocated (for example, allocated from a local variable), use :cpp:func:`lv_font_manager_add_src` to add the resource.
it_it: Nota: se la struttura di descrizione delle risorse font non è allocata staticamente (ad esempio, allocata da una variabile locale), si usa :cpp:func:`lv_font_manager_add_src` per aggiungere la risorsa.

source: Note that if you want to play in reverse from the end of the Timeline, you need to call :cpp:expr:`lv_anim_timeline_set_progress(timeline, LV_ANIM_TIMELINE_PROGRESS_MAX)` after adding all Animations and before telling it to start playing.
it_it: Si noti che per riprodurre al contrario dalla fine della Timeline, è necessario chiamare :cpp:expr:`lv_anim_timeline_set_progress(timeline, LV_ANIM_TIMELINE_PROGRESS_MAX)` dopo aver aggiunto tutte le animazioni e prima di avviare la riproduzione.

source: Note that in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` the small changed areas are rendered directly in the frame buffer so they cannot be rotated later.
it_it: Si noti che in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` le piccole aree modificate vengono renderizzate direttamente nel frame buffer, quindi non possono essere ruotate in un secondo momento.

source: Note that it does not measure the idle time of the overall system, only of :cpp:func:`lv_timer_handler`.
it_it: Si noti che non misura il tempo di inattività dell'intero sistema, ma solo di :cpp:func:`lv_timer_handler`.

source: Note that it doesn't align the Widget itself, only the lines inside the Widget.
it_it: Nota: non allinea il Widget stesso, ma solo le righe al suo interno.

source: Note that it is assumed the tests are performed on a desktop or server environment, where there are no memory constraints.
it_it: Si presuppone che i test vengano eseguiti in un ambiente desktop o server, dove non ci sono vincoli di memoria.

source: Note that like CSS, ``0x123``, ``#123`` and ``123`` all mean ``#112233``.
it_it: Si noti che, come in CSS, ``0x123``, ``#123`` e ``123`` significano tutti ``#112233``.

source: Note that long pressing the Button Matrix with an encoder can mean to enter/leave edit mode and simply long pressing a button to make it repeat as well.
it_it: Si noti che una pressione prolungata sulla Button Matrix con un encoder può significare entrare/uscire dalla modalità di modifica e che una semplice pressione prolungata di un pulsante può anche significare ripeterlo.

source: Note that no sidebar is created.
it_it: Nota: non viene creata alcuna barra laterale.

source: Note that none of the Widget API features such as ``<param>``, ``<enumdef>``, or ``<element>`` can be used for Components.
it_it: Si noti che nessuna delle funzionalità dell'API Widget come ``<param>``, ``<enumdef>`` o ``<element>`` può essere utilizzata per i Componenti.

source: Note that only bitmaps are supported at this time.
it_it: Si noti che al momento sono supportati solo i bitmap.

source: Note that only the API can be defined in XML for elements; implementations must be in C.
it_it: Si noti che solo l'API può essere definita in XML per gli elementi; le implementazioni devono essere in C.

source: Note that only the data's pointer is saved, so whatever it is pointing to needs to remain valid until the function is called, so it can point to ``static``, global or dynamically allocated data.
it_it: Si noti che viene salvato solo il puntatore ai dati, quindi qualsiasi cosa punti deve rimanere valida fino alla chiamata della funzione, in modo che possa puntare a dati ``statici``, globali o allocati dinamicamente.

source: Note that pop-overs for keys in the top row will draw outside the Widget boundaries.
it_it: Si noti che i pop-over per i tasti nella riga superiore verranno visualizzati al di fuori dei limiti del widget.

source: Note that snapshot may fail if the provided buffer is not large enough, which can happen if the Widget's size changes.
it_it: Si noti che lo snapshot potrebbe non funzionare se il buffer fornito non è sufficientemente grande, il che può accadere se le dimensioni del Widget cambiano.

source: Note that the "A:" in the above path is a file system "driver identifier letter" from :ref:`file_system` and used accordingly.
it_it: Si noti che la "A:" nel path sopra riportato è una "lettera identificativa del driver" del file system, da :ref:`file_system` e viene utilizzata di conseguenza.

source: Note that the FS functions make calls to other driver FS functions when the cache is enabled.
it_it: Si noti che le funzioni FS effettuano chiamate ad altre funzioni FS del driver quando la cache è abilitata.

source: Note that the Flex layout feature of LVGL needs to be globally enabled with :c:macro:`LV_USE_FLEX` in ``lv_conf.h``.
it_it: Si noti che la funzionalità di layout Flex di LVGL deve essere abilitata globalmente con :c:macro:`LV_USE_FLEX` in ``lv_conf.h``.

source: Note that the Grid layout feature of LVGL needs to be globally enabled with :c:macro:`LV_USE_GRID` in ``lv_conf.h``.
it_it: Si noti che la funzionalità di layout Grid di LVGL deve essere abilitata globalmente con :c:macro:`LV_USE_GRID` in ``lv_conf.h``.

source: Note that the Lottie loader doesn't support LVGL's File System interface but a "normal path" should be used without a driver letter.
it_it: Notare che il caricatore Lottie non supporta l'interfaccia del file system di LVGL, ma dovrebbe essere utilizzato un "path normale" senza lettera del driver.

source: Note that the built-in widgets of LVGL are registered automatically.
it_it: Si noti che i widget nativi di LVGL vengono registrati automaticamente.
